tutorials/compressible/rhoCentralFoam/forwardStep/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 3;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 3;
    }
    outlet
    {
        type            calculated;
        value           uniform 3;
    }
    bottom
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    obstacle
    {
        type            calculated;
        value           nonuniform List<scalar>
208
(
0
0
0
0
0
0
0
0
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
